//
//  ClauseVC.m
//  PetVoice
//
//  Created by cc on 2020/9/10.
//  Copyright © 2020 cc0717. All rights reserved.
//

#import "ClauseVC.h"

@interface ClauseVC ()
@property (weak, nonatomic) IBOutlet UITextView *textView;

@end

@implementation ClauseVC

- (void)viewDidLoad {
    [super viewDidLoad];
    _textView.text = @"服务协议此协议服务条款是由您与我们就我们提供的客户端服务所订立的相关权利义务规范，本服务条款对您及我们均具有法律效力。 \n   1. 接受条款本协议服务条款可由我们随时更新，且毋须另行通知。服务条款一旦发生变更, 我们将在网页上公布修改内容，修改后的服务条款一旦在网页上公布即有效代替原来的服务条款。您如果不同意本协议的任何条款及后续修改，可以选择停止使用App所提供的全部服务；如果您选择继续使用App服务，则视为您已经完全接受本协议及其修改。\n2. 服务简介在您遵守本协议特定条款和条件的前提下，为您提供拍照、编辑、上传、浏览、删除、下载、分享图片等功能的服务平台。App本身不直接上传、提供图片内容，对您向存储空间平台上传、浏览、删除、下载、分享的图片、照片亦不做任何修改或编辑。您使用服务，须自行配备上网和使用电信增值业务所需的设备，自行负担个人上网或第三方（包括但不限于电信或移动通信提供商）收取的通讯费、信息费等有关费用。本协议中有明确约定的隐私策略，您确保在使用本服务前，已阅读并愿意完全遵循我们公示的隐私制度。我们有权规定并修改使用本服务的一般措施，包括但不限于决定是否保留您相册的基本信息及上载信息、单个帐号的上载、保存权限。 若我们未能依您意愿储存或删除本服务的内容或其他信息，我们对此不承担任何责任。同时我们保留可随时修改或中断服务而不需事先通知您的权利。我们不需对您或第三方负责。除非我们另有明确规定，目前服务的任何新增功能，包括新产品，均无条件地适用本服务条款。3. 您个人资料真实性\n（1）您应当保证自己在使用本服务时身份资料信息的真实性、正确性及完整性，如果资料信息发生变化，您应及时更改，我们不能也不会对您由于资料信息不真实、不准确，或您的资料信息未能及时更新，或因您遗忘密码而引起的任何损失或损害承担责任。若您提供任何错误、不实、过时或不完整的资料信息，并为我们所确知；或者我们有合理理由怀疑前述资料信息为错误、不实、过时或不完整， 我们有权暂停或终止您的帐号，并拒绝您现在或将来使用本服务的全部或一部分。\n（2）在安全完成本服务的登记程序并收到一个密码及帐号后，您应维持密码及帐号的机密安全。您应对任何人利用您的密码及帐号所进行的活动负完全的责任，我们无法对非法或未经您授权使用您帐号及密码的行为作出甄别，因此我们不承担任何责任。禁止转让或非法售卖帐号、密码。如果我们发现使用者并非帐号初始注册人，我们有权收回该帐号而无需向该帐户使用人承担法律责任。\n\n4. 服务用途除非与我们另签协议，否则您同意本服务仅供个人非商业性质的使用。同时，您承诺未经我们事先书面同意，不得利用本服务进行广告、销售、商业展示等商业性用途。如果我们发现您利用本服务进行以上行为，有权删除您上传的内容，或对您相册和账号进行暂时性或永久性封禁，且不需要对您另行通知。\n\n5. 使用规则\n（1）您不得滥用App的服务，我们在此郑重提请您注意，任何经由本服务上传（不论是否系公开上传）、浏览、删除、下载、分享的图片、照片等信息、您的登记资料或其他资料（以下简称“内容”），均由内容提供者、使用者对其上传、使用行为自行承担责任。您保证：不得利用本服务或在我们网页上制作、复制、上传、发布、传播含有下列内容之一的信息：\n① 反对宪法所确定的基本原则的；\n② 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；\n③ 损害国家荣誉和利益的；\n④ 煽动民族仇恨、民族歧视、破坏民族团结的；\n⑤ 破坏国家宗教政策，宣扬邪教和封建迷信的；\n⑥ 散布谣言，扰乱社会秩序，破坏社会稳定的；\n⑦ 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；\n⑧ 侮辱或者诽谤他人，侵害他人合法权利的；\n⑨ 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；\n⑩ 以非法民间组织名义活动的；\n⑪ 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；\n⑫ 含有中国法律、法规以及任何具有法律效力之规范所限制或禁止的其它内容的。\n（2）您必须保证，您拥有您上传之照片等作品之完整、无瑕疵的所有权及知识产权，或您已获得他人合法授权并有权在“”平台上进行上传等一切使用行为，您在本网站之上传行为未侵犯任何第三方之合法权益；您不得将任何内部资料、机密资料、涉及他人隐私资料或侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、或以其他方式在“”平台上传送。否则，将由您独自承担由此带来的一切法律、经济责任；我们因此承担法律责任的，有权利向您追偿。\n（3）您不得利用本服务进行制作、传播计算机病毒等破坏性程序的行为，不得针对本服务、与本服务连接的服务器或网络制造干扰、混乱，或违反连接本服务的网络的任何要求、程序、政策或规则，否则我们将保留追究其法律责任的权利并有权将其提交给相关部门处理。\n（4）我们有权对您上传的图片、添加的文字等内容进行过滤，如果发现有任何违反法律法规或本协议之有关规定的图片、文字，我们有权立即将其删除或屏蔽，且不需要对您另行通知。\n（5）您不得将广告函件、促销资料、垃圾邮件等，加以上载、张贴、发送电子邮件或以其他方式传送。\n（6）您同意遵守《中华人民共和国民法通则》、《中华人民共和国著作权法》、《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《互联网著作权行政保护办法》、《互联网新闻信息服务管理规定》等有关国家法律、法规。 在任何情况下，如您违反国家法律法规或本服务条款，导致我们遭受任何损害或遭受任何来自第三方的纠纷、诉讼、索赔要求等，您须向我们赔偿全部损失（包括直接损失及间接损失）。\n（7）您不得从事任何危害计算机信息网络安全的行为，否则，一经投诉、举报、发现，由您承担一切法律责任并赔偿对我们造成的损失。\n（8）若您使用服务的行为不符合本协议，我们在经由通知、举报等途径发现时有权做出独立判断，且可以在无需事先通知您的情况下立即终止向您提供部分或全部服务。您若通过“”散布和传播反动、色情或其他违反国家法律、法规的信息，“”的系统记录有可能作为您违反法律法规的证据；因您进行上述内容在“”的上载、传播而导致任何第三方提出索赔要求或衍生的任何损害或损失，由您自行承担全部责任。\n（9）我们有权对您使用的情况进行监督，如经由通知、举报等途径发现您在使用提供的网络服务时违反任何本协议的规定，有权要求您改正或直接采取一切认为必要的措施（包括但不限于更改或删除您上载的内容、暂停或终止您使用网络服务的权利）以减轻您不当行为造成的影响。\n\n6. 公共区域内容的许可您同意将您在本服务公共区域（公共区域指一般公众用户可以使用的区域）内公开分享之照片、文字授予全球性、免许可费、非独家、可完全转授权、及永久有效的使用权利，并且可以为了展示、传播及推广张贴前述内容之特定目的，将前述内容以使用、复制、修改、改编、出版、翻译、据以创作衍生作品后用于互联网增值业务或电信增值业务。\n\n7. 服务风险及免责声明\n（1）App仅供娱乐，由特效照片引起的误会，将不承担任何责任。\n（2）您完全理解并同意，本服务涉及到互联网及移动通讯等服务，可能会受到各个环节不稳定因素的影响。因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、您所在位置、您关机、GSM网络、互联网络、通信线路原因等造成的服务中断或不能满足您要求的风险，或可能造成服务取消或终止的风险（您在本服务中储存的任何信息可能无法恢复），使用本服务的您须自行承担以上风险， 对服务之及时性、安全性、准确性不作担保，对因此导致您不能发送和接受阅读消息、或传递错误，个人设定之时效、未予储存或其他问题不承担任何责任。对于不可抗力或非过错原因导致的您数据损失、丢失或服务停止，我们将不承担任何责任。\n（3）对于系统发生故障影响到本服务的正常运行，我们承诺一经发现便及时处理、进行修复。但您因此而产生的经济和精神损失，我们不承担责任。此外，我们保留不经事先通知为维修保养、升级或其他目的暂停提供本服务一部分或全部的权利。\n（4）我们郑重提请您注意，任何经由本服务以上载、发送的内容，无论系公开还是私下传送，均由内容提供者承担责任。我们无法控制经由本服务传送之内容，也无法对您的使用行为进行全面控制，因此不保证内容的合法性、正确性、完整性、真实性或品质；您已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容，并同意将自行加以判断并承担所有风险，而不依赖于我们。 但在任何情况下，我们有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停您使用本服务的全部或部分，保存有关记录，并向有关机关报告。但我们有权(但无义务)依其自行之考量，拒绝和删除可经由本服务提供之违反本条款的或其他引起我们或其他您反感的任何内容。\n（5）您完全理解并同意，若第三方在您不知情或未经您同意的前提下，将您的图片等作品上传于及由此所产生的任何可能侵害您权益的行为，我们均不对任何人承担任何责任。\n（6）您完全理解并同意，第三方可以通过访问我们网站而获得相关信息，并可对信息进行使用、修改、演绎、下载或转载等行为。对您或第三方以任何方式进行的使用、修改、演绎、下载或转载信息等可能侵害您权益的行为，我们均不对任何人承担任何责任。（7）您完全理解并同意，通过本服务收到广告信息，进而与广告商进行任何形式的商业往来，或参与促销活动，包含相关商品或服务之付款及交付，以及达成的其他任何相关条款、条件、保证或声明，完全为您与广告商之间之行为。除有关法律有明文规定要求我们承担责任以外，您因前述任何交易或前述广告商而遭受的任何性质的损失或损害，我们均不予负责。\n（8）我们有权根据服务的需要，在至少提前3日通知您后，冻结或收回您所使用的相册账号。\n\n8. 如发生下列任何一种情形，我们有权随时中断或终止向您提供服务而无需通知您\n（1）您提供的个人资料不真实；\n（2）您违反本服务条款的规定；\n（3）您注册后长期闲置帐号及相应的域名；（4）我们发现您恶意注册相册账号的或我们收到第三方投诉且该第三方出具相应证据的；\n（5）其他我们认为是符合整体服务需求的特殊情形。\n\n9. 信息的披露在如下情况下，我们会披露您的个人信息，由此引发的责任将由您个人承担：\n（1）您授权或同意我们披露的；\n（2）某些情形下，只有透露您的个人资料，才能提供您所执意要求的产品和服务的；\n（3）在紧急情况下，为了保护我们及其您的合法权益或公共安全及利益；（4）根据法律规定或有权部门的要求提供您的个人信息；\n（5）您同意让第三方共享资料；\n（6）我们发现您违反了我们服务条款或任何其他产品服务的使用规定；\n（7）根据我们各服务条款及声明中的相关规定，或者我们认为必要的其他情形下；\n\n10. 内容、标识、软件的所有权内容包括特效名、声音、图片等及在邮件信息、广告中的全部内容。标识及相关图形标识，所有这些内容、标识均受版权、商标权和专利权等法律的保护。所以，您只能在我们授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。App为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，您不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble），或以其他方式发现其原始编码，以及实施任何涉嫌侵害著作权的行为。素材，来自于网络，如果涉及到版权，请与我们联系，我们可以删除。\n\n11. 适用法律及争议管辖本服务条款之效力和解释均适用中华人民共和国之法律。如服务条款之任何一部分与中华人民共和国法律相抵触，则该部分条款应按法律规定重新解释，部分条款之无效或重新解释不影响其它条款之法律效力。您和我们一致同意凡因本服务所产生的纠纷双方应协商解决，协商不成任何一方可提交我们所在地法院诉讼解决。12. 我们拥有对本协议服务条款的最终解释权您对服务之任何部分或本服务条款的任何部分之意见及建议可通过客户服务部门与我们联系。";
    // Do any additional setup after loading the view from its nib.
}
- (IBAction)close:(id)sender {
    [self dismissViewControllerAnimated:NO completion:^{
        
    }];
}

/*
#pragma mark - Navigation

// In a storyboard-based application, you will often want to do a little preparation before navigation
- (void)prepareForSegue:(UIStoryboardSegue *)segue sender:(id)sender {
    // Get the new view controller using [segue destinationViewController].
    // Pass the selected object to the new view controller.
}
*/

@end
